app/views/home/doc.html.erb

<%@subjects.select("DISTINCT(subject)").each do |s| %>
  <%p=Topic.find_by(:sub=>s.subject) %>
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`sub` = 'DBMS' LIMIT 1