app/views/home/pdf.html.erb

SELECT  `topics`.* FROM `topics` WHERE `topics`.`sub` = 'DBMS' LIMIT 1
---
<%@subjects.select("DISTINCT(subject)").each do |s| %>
  <%p=Topic.find_by(:sub=>s.subject) %>