app/views/documents/_form.html.erb

    <%= form.label :Subject %>
    <%= form.collection_select :subject ,Topic.all,:id ,:sub,{:prompt=>'Select any one'} %>
---
SELECT `topics`.* FROM `topics`