app/controllers/documents_controller.rb

SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1
INSERT INTO `documents` (`user_id`, `document_attached_file_name`, `document_attached_content_type`, `document_attached_file_size`, `document_attached_updated_at`, `created_at`, `updated_at`, `subject`) VALUES (1, 'mca801QNS-2018odd-schedule.pdf', 'application/pdf', 54041, '2019-03-10 20:56:37', '2019-03-10 20:56:39', '2019-03-10 20:56:39', 'DBMS')
---
  def create
    @document = Document.new( document_params )
    @document.user_id=current_user.id
    @subject=Topic.find(document_params[:subject]).sub
    @document.subject=@subject
    respond_to do |format|
      if @document.save

UPDATE `documents` SET `document_attached_file_name` = '1.jpg', `document_attached_file_size` = 7930584, `document_attached_updated_at` = '2019-03-07 14:18:53', `updated_at` = '2019-03-07 14:19:00' WHERE `documents`.`id` = 8
---
  def update
    respond_to do |format|
      if @document.update(document_params)

DELETE FROM `documents` WHERE `documents`.`id` = 6
---
  def destroy
    @document.destroy

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 9 LIMIT 1
---
    def set_document
      @document = Document.find(params[:id])