app/controllers/home_controller.rb

  def pdf
    @subjects=Document.all
---
SELECT `documents`.* FROM `documents`

  def topic_wise_list
    @sub=Document.where(:subject=>params[:id])
---
SELECT  `documents`.* FROM `documents` WHERE `documents`.`subject` = 'IT' LIMIT 1

  def topic_wise_video_list
    @sub=Document.where(:subject=>params[:id])
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`subject` = '\"id\"'

  def all_list
    @sub=Document.where(:subject=>params[:id])
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`subject` = 'DBMS'

  def topic_wise_doc_list
    @sub=Document.where(:subject=>params[:id])
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`subject` = 'DBMS'