app/views/layouts/application.html.erb

SELECT `topics`.* FROM `topics`
---
              <li class="active"><a href="/">Home</a></li>
              <%subject=Topic.all %>